판다스 - 데이터 분석 도구
- 구성 요소 3가지 
    - Series : 1개의 컬럼 값만으로 1차원 데이터셋
    - DataFrame : Colum X Row 2차원 데이터셋(테이블구조)
    - Index : 고유한 키 값

#### Series 구조
 - 판다스가 제공하는 객체
 - 객체 생성 : 생성자 호출 -> 전변 초기화 - 파라미터에 아무것도 없는 것 : 디폴트 생성자
 - pd는 Series의 소유주다  
 - Series(list가 올 수 있다.)

In [2]:
type([1,2,3])

list

In [3]:
type({"mem_id":"kiwi"})

dict

In [4]:
import pandas as pd
se=pd.Series([1,2,3,4,5])

특정 값 추출 - values, index

In [5]:
print(se[0])
print(se[3])

1
4

In [6]:
# 파라미터에 리스트도 딕셔너리도 튜플도 됩니다.
se=pd.Series((1,2,3,4,5))

In [7]:
se[len(se)-1]

np.int64(5)

In [8]:
se[2]

np.int64(3)

In [9]:
se[len(se)-1] == se[2]

np.False_

In [10]:
se.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
se.values #Series 안에 Numpy가 포함되어 있다.

array([1, 2, 3, 4, 5])

In [12]:
## index 변경
se.index=['a','b','c','d','e']
se

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
print(se['a'])

1

index이름을 명시하여 Series 생성

In [14]:
# Series 생성2 - index 명시
# Series(파라미터1,파라미터2....)
se2=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
se2.name="numOder" #value 이름
se2.index.name="numName" #index 이름
se2

numName
a    1
b    2
c    3
d    4
e    5
Name: numOder, dtype: int64

In [15]:
se[se>2]

c    3
d    4
e    5
dtype: int64

In [16]:
se[se<3]

a    1
b    2
dtype: int64

In [17]:
se[-(se>2)]

a    1
b    2
dtype: int64

In [18]:
se.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

DataFrame (데이터 프레임)
 - Pandas에서 행과 열을 가지는 자료구조
 - 데이터 프레임은 2차원이므로 행 방향 인덱스와 열 방향 인덱스가 존재
 - 데이터프레임은 열,인덱스,값으로 구성됨

In [19]:
data={'name':['Lee','Park','Kim','choi']
            ,'score':[85,90,100,70]
            ,'grade':['B','A','A','C']}
df=pd.DataFrame(data)
df

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  choi     70     C

In [20]:
df=pd.DataFrame(data, columns=['name','grade','score'])
df

   name grade  score
0   Lee     B     85
1  Park     A     90
2   Kim     A    100
3  choi     C     70

In [21]:
df.values

array([['Lee', 'B', 85],
       ['Park', 'A', 90],
       ['Kim', 'A', 100],
       ['choi', 'C', 70]], dtype=object)

In [22]:
df.columns

Index(['name', 'grade', 'score'], dtype='object')

In [23]:
df.index.name='No'
df.columns.name='info'
df

info  name grade  score
No
0      Lee     B     85
1     Park     A     90
2      Kim     A    100
3     choi     C     70

In [24]:
# 특정값 추출하기
df['name'].values

array(['Lee', 'Park', 'Kim', 'choi'], dtype=object)

In [25]:
# 로우와 컬럼지정으로 특정값 추출
df.loc[1,'name']

'Park'

In [26]:
df=df.set_index('name')
df.loc['Park','grade']

'A'

In [27]:
df

info grade  score
name
Lee      B     85
Park     A     90
Kim      A    100
choi     C     70

In [28]:
# DataFrame을 딕셔너리로 변환
df.to_dict()

{'grade': {'Lee': 'B', 'Park': 'A', 'Kim': 'A', 'choi': 'C'},
 'score': {'Lee': 85, 'Park': 90, 'Kim': 100, 'choi': 70}}

In [29]:
import numpy as np
array=np.array([['Lee',100,'A'],['Park',95,'A'],['Kim',85,'B']])
df=pd.DataFrame(data,columns=['name','score','grade'])
df

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  choi     70     C

데이터 셀렉션 및 필터링   
1) [] - 컬럼기반의 필터링 또는 불린 인덱싱 필터링 제공   
(예: df.컬럼명, df['컬럼명'], df[1:3], df[:2])

In [30]:
df.name

0     Lee
1    Park
2     Kim
3    choi
Name: name, dtype: object

In [31]:
df['name']

0     Lee
1    Park
2     Kim
3    choi
Name: name, dtype: object

In [32]:
# 콜론 앞에 숫자는 시작되는 index이고, 콜론 뒤에 숫자는 미포함
df[1:3]

   name  score grade
1  Park     90     A
2   Kim    100     A

In [33]:
df[:3]

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A

In [34]:
df[:-1]

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A

2) loc[인덱스명,컬럼명] - 명장(labal) 기반 인덱싱   
- index명, column명 기준으로 데이터가 조회됩니다.   
(예: 하나의 행만 검색 - df.loc[0])

In [35]:
df.loc[0]

name     Lee
score     85
grade      B
Name: 0, dtype: object

In [36]:
# 여러 행을 검색할 때
df.loc[[0,1]]

   name  score grade
0   Lee     85     B
1  Park     90     A

In [37]:
# 여러 행과 열을 검색할 때
df.loc[0:2,['score','grade']]

   score grade
0     85     B
1     90     A
2    100     A

In [38]:
df.name

0     Lee
1    Park
2     Kim
3    choi
Name: name, dtype: object

In [39]:
df['name']

0     Lee
1    Park
2     Kim
3    choi
Name: name, dtype: object

In [40]:
df[['name','score']]

   name  score
0   Lee     85
1  Park     90
2   Kim    100
3  choi     70

iloc[인덱스,컬럼인덱스] - 위치 기반 인덱싱   
- 0을 출발점으로 하는 가로축, 세로축 좌표 기반의 행과 열 위치를 기반으로 데이터를 지정   
- 행,열 위치값으로 정수를 사용할 수 있음. 오직 인덱스 기준으로 데이터를 가져옴

In [44]:
df.iloc[0,1]

np.int64(85)

In [41]:
df.iloc[0:2]

   name  score grade
0   Lee     85     B
1  Park     90     A

In [43]:
df.iloc[0:3,0:2]

   name  score
0   Lee     85
1  Park     90
2   Kim    100

In [42]:
df.iloc[0:2,0:1]

   name
0   Lee
1  Park

4. 불링(Boolean) 인덱스

In [46]:
df.loc[df['score']>90]

  name  score grade
2  Kim    100     A

In [47]:
df.loc[df['grade']=='A']

   name  score grade
1  Park     90     A
2   Kim    100     A